STMicroelectronics/STM32CubeWB/Drivers/BSP/STM32WB5MM-DK/stm32wb5mm_dk.c
/**
  ******************************************************************************
  * @file    stm32wb5mm_dk.c
  * @author  MCD Application Team
  * @brief   This file provides set of firmware functions to manage:
  *          - LEDs, push-buttons and COM ports available on STM32WB5MM-DK
  *            board (MB1292) from STMicroelectronics
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32wb5mm_dk.h"

#if (USE_BSP_COM_FEATURE == 1)
#if (USE_COM_LOG == 1)
#include <stdio.h>
#endif
#endif

/** @addtogroup BSP
  * @{
  */

/** @defgroup STM32WB5MM_DK STM32WB5MM-DK
  * @{
  */

/** @defgroup STM32WB5MM_DK_COMMON STM32WB5MM_DK COMMON
  * @brief This file provides set of firmware functions to manage Leds, push-buttons
  *        and COM ports available on STM32WB5MM_DK board from STMicroelectronics.
  * @{
  */

/** @defgroup STM32WB5MM_DK_COMMON_Private_Defines STM32WB5MM-DK COMMON Private Defines
  * @{
  */
#if (USE_BSP_COM_FEATURE == 1)
#if (USE_COM_LOG == 1)
#define COM_POLL_TIMEOUT     1000
#endif /* (USE_COM_LOG == 1) */
#endif /* (USE_BSP_COM_FEATURE == 1) */

#if (USE_COM_LOG == 1)
#ifdef __GNUC__
/* With GCC/RAISONANCE, small msg_info (option LD Linker->Libraries->Small msg_info
   set to 'Yes') calls __io_putchar() */
#define PUTCHAR_PROTOTYPE int __io_putchar(int ch)
#define GETCHAR_PROTOTYPE int __io_getchar(void)
#else
#define PUTCHAR_PROTOTYPE int fputc(int ch, FILE *f)
#define GETCHAR_PROTOTYPE int fgetc(FILE *f)
#endif /* __GNUC__ */
#endif /* COM_LOG ==1 */

#define DELAY                       1u
#define T_CYCLE_0                   4u
#define T_CYCLE_1                   1u
#define WRITE_COMMAND               0x3Au
/**
  * @}
  */

/** @defgroup STM32WB5MM_DK_COMMON_Private_TypesDefinitions STM32WB5MM-DK COMMON Private Types Definitions
  * @{
  */
typedef void (* BSP_EXTI_LineCallback)(void);
/**
  * @}
  */


/** @defgroup STM32WB5MM_DK_COMMON_Private_FunctionPrototypes STM32WB5MM-DK COMMON Private Function Prototypes
  * @{
  */
static void BUTTON_USER1_EXTI_Callback(void);
static void BUTTON_USER2_EXTI_Callback(void);

#if (USE_BSP_COM_FEATURE == 1)
static void COM1_MspInit(UART_HandleTypeDef *huart);
static void COM1_MspDeInit(UART_HandleTypeDef *huart);
#endif /* (USE_BSP_COM_FEATURE == 1) */

static int32_t PWM_LED_WriteData(aPwmLedGsData_TypeDef aPwmLedGsData);
static void    PWM_LED_SendBit(uint8_t bit);
static void    PWM_LED_SenByte(uint8_t byte);
static void    PWM_LED_Wait(uint32_t NbCycles);

static void TIM17_MspInit(TIM_HandleTypeDef *htim);
static void TIM17_MspDeInit(TIM_HandleTypeDef *htim);
/**
  * @}
  */

/** @defgroup STM32WB5MM_DK_COMMON_Exported_Variables STM32WB5MM-DK COMMON Exported Variables
  * @{
  */
EXTI_HandleTypeDef hpb_exti[BUTTONn];
#if (USE_BSP_COM_FEATURE == 1)
UART_HandleTypeDef hcom_uart[COMn];
#endif
/**
  * @}
  */

/** @defgroup STM32WB5MM_DK_COMMON_Private_Variables STM32WB5MM-DK COMMON Private Variables
  * @{
  */
static GPIO_TypeDef* BUTTON_PORT[BUTTONn] = {BUTTON_USER1_GPIO_PORT, BUTTON_USER2_GPIO_PORT};

static const uint16_t BUTTON_PIN[BUTTONn] = {BUTTON_USER1_PIN, BUTTON_USER2_PIN};

static const IRQn_Type BUTTON_IRQn[BUTTONn] = {BUTTON_USER1_EXTI_IRQn, BUTTON_USER2_EXTI_IRQn};

#if (USE_BSP_COM_FEATURE == 1)
static USART_TypeDef*  COM_USART[COMn] = {COM1_UART};

#if (USE_COM_LOG == 1)
static COM_TypeDef COM_ActiveLogPort = COM1;
#endif /* USE_COM_LOG == 1 */

#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
static uint32_t IsComMspCbValid[COMn] = {0};
#endif
#endif /* (USE_BSP_COM_FEATURE == 1) */


static TIM_HandleTypeDef PwmLed_TimerHandle = {0};

static __IO uint32_t CycleCount = 0;

static aPwmLedGsData_TypeDef PWM_LED_GSDATA = {0}; 

#if (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
static uint32_t IsPwmLedMspCbValid = 0;
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS == 1 */
/**
  * @}
  */

/** @defgroup STM32WB5MM_DK_COMMON_Exported_Functions STM32WB5MM-DK COMMON Exported Functions
  * @{
  */

/**
  * @brief  This method returns the STM32WB5MM_DK BSP Driver revision
  * @retval version: 0xXYZR (8bits for each decimal, R for RC)
  */
int32_t BSP_GetVersion(void)
{
  return ((int32_t)STM32WB5MM_DK_BSP_VERSION);
}

/** @defgroup STM32WB5MM_DK_COMMON_PWM_LED_Functions STM32WB5MM-DK COMMON PWM LED Functions
  * @{
  */

/**
  * @brief  Configure PWM LED Driver.
  * @retval BSP error code
  */
int32_t BSP_PWM_LED_Init(void)
{
  int32_t ret = BSP_ERROR_NONE;
  
  GPIO_InitTypeDef  gpio_config = {0};
  
  PWM_LED_SDI_GPIO_CLK_ENABLE();
  gpio_config.Pin       = PWM_LED_SDI_GPIO_PIN;
  gpio_config.Mode      = GPIO_MODE_OUTPUT_PP;
  gpio_config.Pull      = GPIO_PULLDOWN;
  HAL_GPIO_Init(PWM_LED_SDI_GPIO_PORT, &gpio_config);
  HAL_GPIO_WritePin(PWM_LED_SDI_GPIO_PORT, PWM_LED_SDI_GPIO_PIN, GPIO_PIN_RESET);
  
  PWM_LED_SELECT_GPIO_CLK_ENABLE();
  gpio_config.Pin       = PWM_LED_SELECT_GPIO_PIN;
  gpio_config.Mode      = GPIO_MODE_OUTPUT_PP;
  gpio_config.Pull      = GPIO_PULLDOWN;
  HAL_GPIO_Init(PWM_LED_SELECT_GPIO_PORT, &gpio_config);
  HAL_GPIO_WritePin(PWM_LED_SELECT_GPIO_PORT, PWM_LED_SELECT_GPIO_PIN, GPIO_PIN_RESET);

  PwmLed_TimerHandle.Instance = PWM_LED_TIM;
  
#if (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
    if(IsPwmLedMspCbValid == 0U)
    {
      if(BSP_PWM_LED_RegisterDefaultMspCallbacks() != BSP_ERROR_NONE)
      {
        return BSP_ERROR_MSP_FAILURE;
      }
    }
#else
    /* TIM17 MSP initialization */
    TIM17_MspInit(&PwmLed_TimerHandle);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS == 1*/
      
  PwmLed_TimerHandle.Init.Prescaler = (PWM_LED_TIM_GET_COUNTER_CLK_FREQ()/1000000) -1;
  PwmLed_TimerHandle.Init.Period = (PWM_LED_TIM_COUNTER_FREQ/PWM_LED_TIM_FREQ) - 1;
  if (HAL_TIM_Base_Init(&PwmLed_TimerHandle) != HAL_OK) 
  {
    ret = BSP_ERROR_NO_INIT;
  }

  return ret;
}

/**
  * @brief  DeInitialize PWM LED Driver.
  * @retval BSP error code
  */
int32_t BSP_PWM_LED_DeInit(void)
{
  int32_t ret = BSP_ERROR_NONE;

  HAL_GPIO_DeInit(PWM_LED_SELECT_GPIO_PORT, PWM_LED_SELECT_GPIO_PIN);
  HAL_GPIO_DeInit(PWM_LED_SDI_GPIO_PORT, PWM_LED_SDI_GPIO_PIN);
  __HAL_TIM_DISABLE_IT(&PwmLed_TimerHandle, TIM_IT_UPDATE);
  if (HAL_TIM_PWM_DeInit(&PwmLed_TimerHandle) != HAL_OK)
  {
    ret = BSP_ERROR_UNKNOWN_FAILURE;
  }

#if (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
#else
    /* TIM17 MSP de-initialization */
    TIM17_MspDeInit(&PwmLed_TimerHandle);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS == 1*/
  
  return ret;
}

/**
  * @brief  Set the GS data (PWM Control) for each output.
  * @param  aPwmLedGsData GS Data array (one element per output)
  * @retval BSP error code
  */
int32_t BSP_PWM_LED_On(aPwmLedGsData_TypeDef aPwmLedGsData)
{
  return PWM_LED_WriteData(aPwmLedGsData);
}

/**
  * @brief  Turn each output Off.
  * @retval BSP error code
  */
int32_t BSP_PWM_LED_Off(void)
{
  aPwmLedGsData_TypeDef aPwmLedGsData = {PWM_LED_GSDATA_OFF, PWM_LED_GSDATA_OFF, PWM_LED_GSDATA_OFF};
  return PWM_LED_WriteData(aPwmLedGsData);
}

/**
  * @brief  Toggle the selected LED.
  * @param  aPwmLedGsData GS (Gray Scale) data
  * @retval BSP error code
  */
int32_t BSP_PWM_LED_Toggle(aPwmLedGsData_TypeDef aPwmLedGsData)
{
  if (BSP_PWM_LED_GetState() == 0U)
  {
    return PWM_LED_WriteData(aPwmLedGsData);
  }
  else
  {
    return BSP_PWM_LED_Off();
  }
}

/**
  * @brief  Indicate whether outputs are turned on or off.
  * @retval 0 means off, 1 means on
  */
int32_t BSP_PWM_LED_GetState(void)
{
  return (((PWM_LED_GSDATA[PWM_LED_RED] == PWM_LED_GSDATA_OFF)
        && (PWM_LED_GSDATA[PWM_LED_GREEN] == PWM_LED_GSDATA_OFF)
        && (PWM_LED_GSDATA[PWM_LED_BLUE] == PWM_LED_GSDATA_OFF)) ? 0U : 1U);
}

/**
  * @brief  BSP PWM LED interrupt handler.
  * @retval None
  */
void BSP_PWM_LED_IRQHandler(void)
{
  __HAL_TIM_CLEAR_FLAG(&PwmLed_TimerHandle, TIM_IT_UPDATE);
  CycleCount++;
}

#if (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
/**
  * @brief Register Default PWM LED Msp Callbacks
  * @retval BSP status
  */
int32_t BSP_PWM_LED_RegisterDefaultMspCallbacks(void)
{
  BSP_PWM_LED_Cb_t CallBacks;
  
