STMicroelectronics/STM32CubeWB/Drivers/BSP/STM32WB5MM-DK/stm32wb5mm_dk.c
  /* Disable USART clock */
  COM1_CLK_DISABLE();
}
#endif /* (USE_BSP_COM_FEATURE == 1) */

/**
  * @brief  Write GS data into the PWM LED driver through a single-wire interface
  * @param  aPwmLedGsData GS (Gray Scale) data
  * @retval BSP status
  */
static int32_t PWM_LED_WriteData(aPwmLedGsData_TypeDef aPwmLedGsData)
{
  if (aPwmLedGsData == NULL)
  {
    return BSP_ERROR_WRONG_PARAM;
  }
  
  __HAL_TIM_ENABLE_IT(&PwmLed_TimerHandle, TIM_IT_UPDATE);
  
  /* Start time base */
  if (HAL_TIM_Base_Start(&PwmLed_TimerHandle) != HAL_OK)
  {
    return BSP_ERROR_UNKNOWN_FAILURE;   
  }
  
  /* Enable Grayscale (GS) Control */
  HAL_GPIO_WritePin(PWM_LED_SELECT_GPIO_PORT, PWM_LED_SELECT_GPIO_PIN, GPIO_PIN_SET);
  
  /* TCycle measurement sequence */
  HAL_GPIO_WritePin(PWM_LED_SDI_GPIO_PORT, PWM_LED_SDI_GPIO_PIN, GPIO_PIN_SET);
  PWM_LED_Wait(DELAY);
  HAL_GPIO_WritePin(PWM_LED_SDI_GPIO_PORT, PWM_LED_SDI_GPIO_PIN, GPIO_PIN_RESET);
  PWM_LED_Wait(T_CYCLE_0);
  
  /* Write command */
  PWM_LED_SenByte(WRITE_COMMAND);
  
  /* Write the GS data */
  for (uint8_t gsdata = 0; gsdata < PWM_LED_NB; gsdata++)
  {
    PWM_LED_GSDATA[gsdata] = aPwmLedGsData[gsdata];
    PWM_LED_SenByte(PWM_LED_GSDATA[gsdata]);
  }
  
  /* Disable Grayscale (GS) Control */
  HAL_GPIO_WritePin(PWM_LED_SELECT_GPIO_PORT, PWM_LED_SELECT_GPIO_PIN, GPIO_PIN_RESET);
  
  /* Stop time base */
  if (HAL_TIM_Base_Stop(&PwmLed_TimerHandle) != HAL_OK)
  {
    return BSP_ERROR_UNKNOWN_FAILURE;   
  }

  return BSP_ERROR_NONE;
}

/**
  * @brief  Data 0/1 write sequence
  * @param  bit
  * @retval None
  */
static void PWM_LED_SendBit(uint8_t bit)
{
  /* Start next cycle */
  HAL_GPIO_WritePin(PWM_LED_SDI_GPIO_PORT, PWM_LED_SDI_GPIO_PIN, GPIO_PIN_SET);
  PWM_LED_Wait(DELAY); 
  HAL_GPIO_WritePin(PWM_LED_SDI_GPIO_PORT, PWM_LED_SDI_GPIO_PIN, GPIO_PIN_RESET);
  PWM_LED_Wait(DELAY);
  
  if (bit)
  {
    HAL_GPIO_WritePin(PWM_LED_SDI_GPIO_PORT, PWM_LED_SDI_GPIO_PIN, GPIO_PIN_SET);
    PWM_LED_Wait(DELAY);
    HAL_GPIO_WritePin(PWM_LED_SDI_GPIO_PORT, PWM_LED_SDI_GPIO_PIN, GPIO_PIN_RESET);
    PWM_LED_Wait(T_CYCLE_1);
  }
  else
  {
    PWM_LED_Wait(T_CYCLE_0);
  }
}

/**
  * @brief  Byte write Sequence
  * @param  byte
  * @retval None
  */
static void PWM_LED_SenByte(uint8_t byte)
{
    PWM_LED_SendBit(byte & (1<<7));
    PWM_LED_SendBit(byte & (1<<6));
    PWM_LED_SendBit(byte & (1<<5));
    PWM_LED_SendBit(byte & (1<<4));
    PWM_LED_SendBit(byte & (1<<3));
    PWM_LED_SendBit(byte & (1<<2));
    PWM_LED_SendBit(byte & (1<<1));
    PWM_LED_SendBit(byte & (1<<0));
}

/**
  * @brief  Byte write Sequence
  * @param  NbCycles Number of cycles to wait for
  * @retval None
  */
static void PWM_LED_Wait(uint32_t NbCycles)
{
  uint32_t start = CycleCount;
  
  while ((CycleCount - start) < NbCycles)
  {
  }
}

/**
  * @brief  Timer MSP initialization
  * @param  htim Timer instance
  * @retval None
  */
void TIM17_MspInit(TIM_HandleTypeDef *htim)
{
  if (htim->Instance == PWM_LED_TIM)
  {
    PWM_LED_TIM_CLOCK_ENABLE();
    
    HAL_NVIC_SetPriority(PWM_LED_TIM_UP_IRQN, PWM_LED_CLOCK_IT_PRIORITY, 0);
    HAL_NVIC_EnableIRQ(PWM_LED_TIM_UP_IRQN);
  }
}

/**
  * @brief  Timer MSP de-initialization
  * @param  htim Timer instance
  * @retval None
  */
void TIM17_MspDeInit(TIM_HandleTypeDef *htim)
{
  if (htim->Instance == PWM_LED_TIM)
  {
    HAL_NVIC_DisableIRQ(PWM_LED_TIM_UP_IRQN);
    PWM_LED_TIM_CLOCK_DISABLE();
  }
}
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
